DSU/src/AccumulationRegisters/ОстаткиПоСчетам/ОстаткиПоСчетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоСчетам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DSU/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DSU/src/Catalogs/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Счета</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Забалансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ликвидный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматВыписки</name>
    <type>
      <types>EnumRef.ФорматыВыписки</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

DSU/src/CommonModules/ОбщегоНазначенияВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьОсновнуюВалютуУчета() Экспорт 
	
	Возврат ОбщегоНазначенияПовтИсп.ОсновнаяВалютаУчета();
	
КонецФункции

Функция ПолучитьСуммуЛиквидов(ДатаОтчета) Экспорт 
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОстаткиПоСчетам.СуммаОстаток * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСчетам.Остатки(
	               |			&ДатаОтчета,
	               |			Счет В
	               |				(ВЫБРАТЬ
	               |					Справочник.Счета.Ссылка
	               |				ИЗ
	               |					Справочник.Счета
	               |				ГДЕ
	               |					Справочник.Счета.Забалансовый = ЛОЖЬ
	               |					И Справочник.Счета.Ликвидный = ИСТИНА)) КАК ОстаткиПоСчетам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОтчета, ) КАК КурсыВалютСрезПоследних
	               |		ПО ОстаткиПоСчетам.Валюта = КурсыВалютСрезПоследних.Валюта";
	Запрос.УстановитьПараметр("ДатаОтчета", Новый Граница(ДатаОтчета, ВидГраницы.Включая));				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Сумма;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции	

Функция ПолучитьСтруктуруРасшифровки(Расшифровка, ДанныеРасшифровки) Экспорт 
	
	СтруктураРасшифровки = Новый Структура;
	Коллекция = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Элемент = Коллекция.Элементы[Расшифровка];
	ОбработатьПолеРасшифровки(Элемент, СтруктураРасшифровки);
	
	Возврат СтруктураРасшифровки;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПолеРасшифровки(Элемент, СтруктураРасшифровки) 

	Если ТипЗнч(Элемент) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда 
		
		ПоляЭлемента = Элемент.ПолучитьПоля();	
		
		Для Каждого ПолеЭлемента Из ПоляЭлемента Цикл
			
			Попытка
				СтруктураРасшифровки.Вставить(СтрЗаменить(ПолеЭлемента.Поле, ".", ""), ПолеЭлемента.Значение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения расшифровки");
			КонецПопытки;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	РодителиПоля = Элемент.ПолучитьРодителей();
	
	Для Каждого РодительПоля Из РодителиПоля Цикл
		ОбработатьПолеРасшифровки(РодительПоля, СтруктураРасшифровки)
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
